---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.RebarShapeSegment
source: html/3ed1c54c-382c-3d3b-cbda-47568c13ac76.htm
---
# RebarShapeSegment Members

Releases all resources used by the RebarShapeSegment